Repository: t-pereira06/42_transcendence
Catalog: transcendence/tools/transcendence/locale/*/LC_MESSAGES/django.po
Languages: pt

# span_tfa_enable_long
source: Enable Two-Factor Authentication
pt: Ativar Autenticação de Dois Fatores

# form_label_tfa_code
source: Authentication Code
pt: Código de Autenticação

# form_placeholder_tfa_code
source: Enter authentication code
pt: Introduzir código de autenticação

# main_tfa_enable_short
source: Enable 2FA
pt: Ativar 2FA

# main_close
source: Close
pt: Fechar

# main_friend_add
source: Add Friend
pt: Adicionar Amigo

# main_friend_remove
source: Remove Friend
pt: Remover Amigo

# span_name
source: Name
pt: Nome

# main_private
source: Private
pt: Privado

# main_public
source: Public
pt: Público

# form_label_username_main
source: Username
pt: Nome de Utilizador

# main_language
source: Language
pt: Idioma

# span_tfa_auth
source: Two-Factor Authentication
pt: Autenticação de Dois Fatores

# main_tfa_disable_short
source: Disable 2FA
pt: Desativar 2FA

# main_danger
source: Danger Zone
pt: Zona de Perigo

# main_delete_account
source: Delete Account
pt: Eliminar Conta

# logs_error_unknown
source: An unknown error occurred.
pt: Ocorreu um erro desconhecido.

# main_game_home
source: Home
pt: Casa

# main_game_away
source: Away
pt: Fora

# logs_error_template_not_found %(template_name)s
source: Template not found: %(template_name)s
pt: Modelo não encontrado: %(template_name)s

# logs_error_template_could_not_load %(template_name)s
source: Could not load template: %(template_name)s
pt: Não foi possível carregar o modelo: %(template_name)s

# main_game_tour_semi_finals
source: Semi-Finals
pt: Meias-Finais

# main_game_tour_quarter_finals
source: Quarter-Finals
pt: Quartos de Final

# main_game_tour_round_of_16
source: Round of 16
pt: Oitavos de Final

# main_game_tour_play_off %(round_count)s
source: Play-off %(round_count)s
pt: %(round_count)sª Eliminatória

# logs_error_name_1 %(description)s %(min_name_length)s
source: %(description)s must be at least %(min_name_length)s characters.
pt: %(description)s deve ter pelo menos %(min_name_length)s caracteres.

# logs_error_name_2 %(description)s
source: %(description)s must only contain letters, numbers, and underscores.
pt: %(description)s deve conter apenas letras, números e underscores.

# logs_error_name_3 %(description)s
source: %(description)s cannot start or end with an underscore.
pt: %(description)s não pode começar ou terminar com um underscore.

# logs_error_username_1 %(min_user_length)s %(max_user_length)s
source: Username must be between %(min_user_length)s and %(max_user_length)s characters.
pt: O nome de utilizador deve ter entre %(min_user_length)s e %(max_user_length)s caracteres.

# logs_error_username_2
source: Username must only contain lowercase letters, numbers, and underscores.
pt: O nome de utilizador deve conter apenas letras minúsculas, números e underscores.

# logs_error_username_3
source: Username cannot start or end with an underscore.
pt: O nome de utilizador não pode começar ou terminar com um underscore.

# logs_error_password_1 %(min_pass_length)s
source: Password must be at least %(min_pass_length)s characters.
pt: A palavra-passe deve ter pelo menos %(min_pass_length)s caracteres.

# logs_error_password_2
source: Password must contain at least one uppercase letter.
pt: A palavra-passe deve conter pelo menos uma letra maiúscula.

# logs_error_password_3
source: Password must contain at least one lowercase letter.
pt: A palavra-passe deve conter pelo menos uma letra minúscula.

# logs_error_password_4
source: Password must contain at least one number.
pt: A palavra-passe deve conter pelo menos um número.

# logs_error_password_5
source: Password must contain at least one special character.
pt: A palavra-passe deve conter pelo menos um carácter especial.

# logs_error_password_requirements_1
source: Password must contain at least one uppercase letter, one lowercase letter, one number, and one special character.
pt: A palavra-passe deve conter pelo menos uma letra maiúscula, uma letra minúscula, um número e um carácter especial.

# logs_error_password_6
source: New password cannot be the same as the old password.
pt: A nova palavra-passe não pode ser igual à palavra-passe antiga.

# logs_error_password_requirements_2
source: Password must contain at least one uppercase letter, one lowercase letter, and one number.
pt: A palavra-passe deve conter pelo menos uma letra maiúscula, uma letra minúscula e um número.

# logs_error_need_sign_out
source: You need to sign out first.
pt: Precisa de terminar sessão primeiro.

# description_first_name
source: First name
pt: Primeiro nome

# description_last_name
source: Last name
pt: Último nome

# logs_error_user_already_exists
source: User already exists.
pt: O utilizador já existe.

# logs_error_password_dont_match
source: Passwords don't match.
pt: As palavras-passe não coincidem.

# logs_error_image_invalid_upload
source: Invalid image upload.
pt: Upload de imagem inválido.

# logs_error_need_accept_terms
source: You need to accept the terms and conditions.
pt: Precisa de aceitar os termos e condições.

# main_profile
source: Profile
pt: Perfil

# logs_success_user_signed_up %(username)s
source: User %(username)s successfully signed up.
pt: Utilizador %(username)s registado com sucesso.

# logs_error_need_sign_in_up
source: You need to sign in or sign up first.
pt: Precisa de iniciar sessão ou registar-se primeiro.

# logs_success_user_signed_out %(username)s
source: User %(username)s successfully signed out.
pt: Utilizador %(username)s terminou sessão com sucesso.

# logs_error_user_not_found %(username)s
source: User %(username)s not found.
pt: Utilizador %(username)s não encontrado.

# logs_error_user_no_password
source: User has not set a password yet.
pt: O utilizador ainda não definiu uma palavra-passe.

# logs_error_password_wrong %(username)s
source: Incorrect password for user %(username)s.
pt: Palavra-passe incorreta para o utilizador %(username)s.

# logs_success_user_signed_in %(username)s
source: User %(username)s successfully signed in.
pt: Utilizador %(username)s iniciou sessão com sucesso.

# logs_success_password_set
source: Password successfully set.
pt: Palavra-passe definida com sucesso.

# logs_error_need_config_pass
source: You need to configure your password first.
pt: Precisa de configurar a sua palavra-passe primeiro.

# logs_error_password_wrong_old
source: Incorrect old password.
pt: Palavra-passe antiga incorreta.

# logs_error_password_bad_new
source: Invalid new password.
pt: Nova palavra-passe inválida.

# logs_success_user_updated
source: User successfully updated.
pt: Utilizador atualizado com sucesso.

# logs_error_tfa_already_enabled
source: Two-factor authentication is already enabled.
pt: A autenticação de dois fatores já está ativada.

# logs_error_tfa_invalid_code
source: Invalid authentication code.
pt: Código de autenticação inválido.

# logs_success_tfa_enabled
source: Two-factor authentication successfully enabled.
pt: Autenticação de dois fatores ativada com sucesso.

# logs_success_tfa_verified
source: Two-factor authentication successfully verified.
pt: Autenticação de dois fatores verificada com sucesso.

# logs_error_tfa_already_disabled
source: Two-factor authentication is already disabled.
pt: A autenticação de dois fatores já está desativada.

# logs_success_tfa_disabled
source: Two-factor authentication successfully disabled.
pt: Autenticação de dois fatores desativada com sucesso.

# logs_error_user_cannot_delete_other
source: You cannot delete another user's account.
pt: Não pode eliminar a conta de outro utilizador.

# logs_success_user_deleted %(username)s
source: User %(username)s successfully deleted.
pt: Utilizador %(username)s eliminado com sucesso.

# logs_error_friend_cannot_be_with_self
source: You cannot add yourself as a friend.
pt: Não se pode adicionar a si próprio como amigo.

# logs_error_friend_already %(username)s
source: %(username)s is already your friend.
pt: %(username)s já é seu amigo.

# logs_success_friend_added
source: Friend successfully added.
pt: Amigo adicionado com sucesso.

# logs_success_friend_removed
source: Friend successfully removed.
pt: Amigo removido com sucesso.

# logs_success_language_updated
source: Language successfully updated.
pt: Idioma atualizado com sucesso.

# terms_span
source: Terms and Conditions
pt: Termos e Condições

# main_tfa_verify_code
source: Verify Authentication Code
pt: Verificar Código de Autenticação

# span_config_pass
source: Configure Password
pt: Configurar Palavra-Passe

# form_label_password_main
source: Password
pt: Palavra-Passe

# form_placeholder_password_main
source: Enter password
pt: Introduzir palavra-passe

# form_label_password_confirm
source: Confirm Password
pt: Confirmar Palavra-Passe

# form_placeholder_password_confirm
source: Confirm password
pt: Confirmar palavra-passe

# span_profile_settings
source: Profile Settings
pt: Definições de Perfil

# form_label_name_first
source: First Name
pt: Primeiro Nome

# form_placeholder_name_first
source: Enter first name
pt: Introduzir primeiro nome

# form_label_name_last
source: Last Name
pt: Último Nome

# form_placeholder_name_last
source: Enter last name
pt: Introduzir último nome

# form_label_name_anonymous
source: Anonymous Name
pt: Nome Anónimo

# form_placeholder_username_main
source: Enter username
pt: Introduzir nome de utilizador

# form_label_password_old
source: Old Password
pt: Palavra-Passe Antiga

# form_placeholder_password_old
source: Enter old password
pt: Introduzir palavra-passe antiga

# form_label_password_new
source: New Password
pt: Nova Palavra-Passe

# form_placeholder_password_new
source: Enter new password
pt: Introduzir nova palavra-passe

# form_label_password_confirm_new
source: Confirm New Password
pt: Confirmar Nova Palavra-Passe

# form_placeholder_password_confirm_new
source: Confirm new password
pt: Confirmar nova palavra-passe

# form_label_profile_image
source: Profile Image
pt: Imagem de Perfil

# main_image_profile_upload
source: Upload Profile Image
pt: Carregar Imagem de Perfil

# main_save_changes
source: Save Changes
pt: Guardar Alterações

# logs_warn_delete_account_1
source: Warning: This action is irreversible!
pt: Aviso: Esta ação é irreversível!

# logs_warn_delete_account_2
source: Are you sure you want to delete your account?
pt: Tem a certeza que quer eliminar a sua conta?

# form_label_username_friend
source: Friend's Username
pt: Nome de Utilizador do Amigo

# form_placeholder_username_friend
source: Enter friend's username
pt: Introduzir nome de utilizador do amigo

# main_game_over
source: Game Over
pt: Fim do Jogo

# main_game_over_message
source: The game has ended. Check the results!
pt: O jogo terminou. Verifique os resultados!

# main_sign_up
source: Sign Up
pt: Registar

# main_accept
source: Accept
pt: Aceitar

# main_sign_in
source: Sign In
pt: Iniciar Sessão

# main_change_lang
source: Change Language
pt: Alterar Idioma

# main_friend_main
source: Friends
pt: Amigos

# main_game_main
source: Game
pt: Jogo

# main_sign_with
source: Sign in with
pt: Iniciar sessão com

# main_sign_out
source: Sign Out
pt: Terminar Sessão

# main_welcome
source: Welcome to Pong!
pt: Bem-vindo ao Pong!

# main_session_welcome %(first_name)s %(last_name)s
source: Welcome, %(first_name)s %(last_name)s!
pt: Bem-vindo, %(first_name)s %(last_name)s!

# main_game_matches
source: Matches
pt: Partidas

# main_game_date
source: Date
pt: Data

# main_game_type
source: Type
pt: Tipo

# main_game_opponent
source: Opponent
pt: Adversário

# main_game_place
source: Place
pt: Local

# main_game_result
source: Result
pt: Resultado

# main_game_match
source: Match
pt: Partida

# main_game_tournament
source: Tournament
pt: Torneio

# terms_pro_title
source: Terms of Service
pt: Termos de Serviço

# terms_pro_strong
source: Protection of Personal Information
pt: Proteção de Informações Pessoais

# terms_pro_text
source: We are committed to protecting your personal information in accordance with applicable laws.
pt: Estamos comprometidos em proteger as suas informações pessoais de acordo com as leis aplicáveis.

# terms_gdpr_title
source: Your Rights Under GDPR
pt: Os Seus Direitos ao Abrigo do RGPD

# terms_gdpr_main_strong
source: Right of Access
pt: Direito de Acesso

# terms_gdpr_main_text
source: You have the right to request access to your personal data that we hold.
pt: Tem o direito de solicitar acesso aos seus dados pessoais que armazenamos.

# terms_gdpr_rect_strong
source: Right to Rectification
pt: Direito à Retificação

# terms_gdpr_rect_text
source: You have the right to request correction of any inaccurate or incomplete data.
pt: Tem o direito de solicitar a correção de quaisquer dados imprecisos ou incompletos.

# terms_gdpr_eras_strong
source: Right to Erasure
pt: Direito ao Esquecimento

# terms_gdpr_eras_text
source: You have the right to request deletion of your personal data under certain conditions.
pt: Tem o direito de solicitar a eliminação dos seus dados pessoais sob certas condições.

# terms_gdpr_rest_strong
source: Right to Restriction of Processing
pt: Direito à Restrição do Processamento

# terms_gdpr_rest_text
source: You have the right to request restriction of processing of your personal data under certain conditions.
pt: Tem o direito de solicitar a restrição do processamento dos seus dados pessoais sob certas condições.

# terms_gdpr_obj_strong
source: Right to Object
pt: Direito de Oposição

# terms_gdpr_obj_text
source: You have the right to object to the processing of your personal data under certain conditions.
pt: Tem o direito de se opor ao processamento dos seus dados pessoais sob certas condições.

# terms_wuydf_title
source: What You Should Do
pt: O Que Deve Fazer

# terms_wuydf_subtitle
source: If you wish to exercise any of these rights, please contact us.
pt: Se desejar exercer algum destes direitos, por favor contacte-nos.

# terms_wuydf_strong
source: Contact Information
pt: Informações de Contacto

# terms_wuydf_text
source: For any questions regarding your rights or our privacy practices, please contact us.
pt: Para quaisquer questões relativas aos seus direitos ou às nossas práticas de privacidade, por favor contacte-nos.

# main_game_player
source: Player
pt: Jogador

# main_game_continue
source: Continue
pt: Continuar Jogo

# span_game_settings
source: Game Settings
pt: Definições do Jogo

# form_label_game_ball_color
source: Ball Color
pt: Cor da Bola

# form_label_game_field_color
source: Field Color
pt: Cor do Campo

# form_label_game_field_image
source: Field Image
pt: Imagem do Campo

# main_image_game_field_upload
source: Upload Field Image
pt: Carregar Imagem do Campo

# form_label_game_max_points
source: Max Points
pt: Pontos Máximos

# form_label_game_padel_color
source: Padel Color
pt: Cor da Raquete

# main_game_start
source: Start Game
pt: Começar Jogo

# main_game_player_home
source: Home Player
pt: Jogador da Casa

# main_game_player_away
source: Away Player
pt: Jogador Visitante

# span_game_choose_opponent
source: Choose Opponent
pt: Escolher Adversário

# form_label_username_opponent
source: Opponent's Username
pt: Nome de Utilizador do Adversário

# form_placeholder_username_opponent
source: Enter opponent's username
pt: Introduzir nome de utilizador do adversário

# main_game_config
source: Configure Game
pt: Configurar Jogo

# span_game_tour_check_player
source: Check Player for Tournament
pt: Verificar Jogador para o Torneio

# form_label_username_player
source: Player's Username
pt: Nome de Utilizador do Jogador

# form_placeholder_username_player
source: Enter player's username
pt: Introduzir nome de utilizador do jogador

# main_game_tour_check_player
source: Check Player
pt: Verificar Jogador

# main_game_tour_start
source: Start Tournament
pt: Começar Torneio

# span_game_tournament_settings
source: Tournament Settings
pt: Definições do Torneio

# form_label_game_host_padel_color
source: Host Padel Color
pt: Cor da Raquete do Anfitrião

# main_game_config_tournament
source: Configure Tournament
pt: Configurar Torneio

# main_game_home_player
source: Home Player
pt: Jogador da Casa

# main_game_away_player
source: Away Player
pt: Jogador Visitante

# logs_error_game_same_alias_1
source: Both players cannot have the same alias.
pt: Ambos os jogadores não podem ter o mesmo pseudónimo.

# main_game_winner
source: Winner
pt: Vencedor

# logs_error_game_range_points %(min_points)s %(max_points)s
source: Game points must be between %(min_points)s and %(max_points)s.
pt: Os pontos do jogo devem estar entre %(min_points)s e %(max_points)s.

# main_game_next
source: Next match
pt: Próxima partida

# main_game_players_auto_next_round
source: Players will automatically advance to the next round.
pt: Os jogadores irão avançar automaticamente para a próxima ronda.

# logs_error_game_same_alias_2
source: Player alias already exists in the tournament.
pt: O pseudónimo do jogador já existe no torneio.

# logs_game_tour_checked %(alias_name)s
source: Player %(alias_name)s checked for the tournament.
pt: Jogador %(alias_name)s verificado para o torneio.

# logs_success_game_saved
source: Game settings saved successfully.
pt: Definições do jogo guardadas com sucesso.

# logs_success_tournament_saved
source: Tournament settings saved successfully.
pt: Definições do torneio guardadas com sucesso.

# main_game_wins
source: Wins
pt: Vitórias

# main_game_losses
source: Losses
pt: Derrotas

# main_game_scored_points
source: Points Scored
pt: Pontos Marcados

# main_game_conceded_points
source: Points Conceded
pt: Pontos Sofridos

# main_game_stats
source: Game stats
pt: Estatísticas de Jogo

# main_tour_stats
source: Tournament Stats
pt: Estatísticas de Torneio

# main_point_stats
source: Goal Stats
pt: Estatísticas de Pontos

# lang_en
source: English
pt: Inglês

# lang_pt
source: Portuguese
pt: Português

# lang_es
source: Spanish
pt: Espanhol
